app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Soccer"], ["room_number", 212], ["created_at", "2021-03-25 01:28:57.038777"], ["updated_at", "2021-03-25 01:28:57.038777"]]
---
def create
    # binding.pry
    @school_class = SchoolClass.new(school_class_params(:title, :room_number))
    @school_class.save